app/controllers/api/attachments_controller.rb

  def create
    @idea = Idea.find(params[:idea_id])
    @idea.attachment = params[:file]
    if @idea.save!
---
SELECT  "ideas".* FROM "ideas"  WHERE "ideas"."id" = $1 LIMIT 1
UPDATE "ideas" SET "attachment" = $1, "updated_at" = $2 WHERE "ideas"."id" = 26