app/views/ideas/index.html.slim

        |By:
        =idea.user.first_name
      .button-group
---
SELECT  "users".* FROM "users"  WHERE "users"."id" = 5  ORDER BY "users"."id" ASC LIMIT 1

          |Users:
          =idea.joins.count
---
SELECT COUNT(*) FROM "joins"  WHERE "joins"."idea_id" = $1  [["idea_id", 5]]

          |Likes:
          =idea.likes.count
---
SELECT COUNT(*) FROM "likes"  WHERE "likes"."idea_id" = $1  [["idea_id", 5]]