app/views/ideas/show.html.slim

SELECT  "users".* FROM "users"  WHERE "users"."id" = $1 LIMIT 1
---
      |By:
      =@idea.user.first_name

SELECT "comments".* FROM "comments"  WHERE "comments"."idea_id" = $1
---
    .well
     -@idea.comments.each do |comment|

SELECT "joins".* FROM "joins"  WHERE "joins"."idea_id" = $1
---
    h4 Users that are backing this idea
    - @idea.joins.each do |join|