app/controllers/comments_controller.rb

SELECT  "ideas".* FROM "ideas"  WHERE "ideas"."id" = $1 LIMIT 1
INSERT INTO "comments" ("body", "created_at", "idea_id", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"
---
  def create
    @idea = Idea.find params[:idea_id]
    @comment = @idea.comments.new comment_params
    @comment.user = current_user
    if @comment.save

SELECT  "comments".* FROM "comments"  WHERE "comments"."id" = $1 LIMIT 1  [["id", 1]]
DELETE FROM "comments" WHERE "comments"."id" = $1  [["id", 1]]
---
  def destroy
    @comment = Comment.find params[:id]
    if @comment.user == current_user
      if @comment.destroy