app/controllers/ideas_controller.rb

  def create
    @idea = Idea.new idea_params
    @idea.user = current_user
    if @idea.save
---
INSERT INTO "ideas" ("created_at", "description", "title", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"

  def destroy
    if @idea.destroy
---
DELETE FROM "ideas" WHERE "ideas"."id" = $1  [["id", 1]]

  def find_idea
    @idea = Idea.find params[:id]
---
SELECT  "ideas".* FROM "ideas"  WHERE "ideas"."id" = $1 LIMIT 1

  def find_ideas
    @ideas = Idea.all.paginate(page: params[:page], per_page: 10)
---
SELECT  "ideas".* FROM "ideas"  LIMIT 10 OFFSET 0
SELECT COUNT(*) FROM "ideas"