app/controllers/joins_controller.rb

  def create
    if @idea.joins_for(current_user) == nil && @idea.user != current_user
      @join = @idea.joins.new
      @join.user = current_user
      if @join.save
---
SELECT  "joins".* FROM "joins"  WHERE "joins"."idea_id" = $1 AND "joins"."user_id" = 5 LIMIT 1  [["idea_id", 5]]
INSERT INTO "joins" ("created_at", "idea_id", "updated_at", "user_id") VALUES ($1, $2, $3, $4) RETURNING "id"  [["created_at", "2014-10-31 18:42:56.654527"], ["idea_id", 5], ["updated_at", "2014-10-31 18:42:56.654527"], ["user_id", 5]]

  def destroy
    @join = Join.find params[:id]
    if @join.destroy
---
SELECT  "joins".* FROM "joins"  WHERE "joins"."id" = $1 LIMIT 1  [["id", 1]]
DELETE FROM "joins" WHERE "joins"."id" = $1  [["id", 1]]

  def find_idea
    @idea = Idea.find params[:idea_id]
---
SELECT  "ideas".* FROM "ideas"  WHERE "ideas"."id" = $1 LIMIT 1  [["id", 5]]