app/controllers/likes_controller.rb

INSERT INTO "likes" ("created_at", "idea_id", "updated_at", "user_id") VALUES ($1, $2, $3, $4) RETURNING "id"  [["created_at", "2014-10-31 18:50:06.268568"], ["idea_id", 5], ["updated_at", "2014-10-31 18:50:06.268568"], ["user_id", 5]]
---
  def create
    if @idea.likes_for(current_user) == nil && @idea.user != current_user
      @like = @idea.likes.new
      @like.user = current_user
      if @like.save

SELECT  "ideas".* FROM "ideas"  WHERE "ideas"."id" = $1 LIMIT 1  [["id", 5]]
---
  def find_idea
    @idea = Idea.find params[:idea_id]